# vstGetModeHelpBase

## Description
```pascal
PROCEDURE vstGetModeHelpBase(VAR outTextRsrcIDBase : INTEGER);
```

```python

def vs.vstGetModeHelpBase():
    return outTextRsrcIDBase
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outTextRsrcIDBase|INTEGER||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events